// Aleksey Kuznetsov <alek-kuzne@yandex.ru>
// Урок 13. Графы

#include<stdio.h>

/* 1.) Реализовать обход графа в глубину с использованием стека void depthTraversStack(int** matrix, int size) */



/* 2.) Моделируем робот поисковой системы.
Дан готовый неориентированный, невзвешенный, несмежный простой граф с петельными связями(т.е. могут быть ребра из вершины A в вершину A). Внутри графа могут
содержаться циклы.
Нужно обойти этот граф двумя способами и подсчитать количество ссылок на каждый из узлов графа (полустепень захода).
a) Обход графа по матрице смежности (с подсчётом всех вершин графа) - void adjacencyCount(int** matrix, int start, const int size)*/


/*
b) Обход графа рекурсивной функцией (с подсчётом только смежных со стартовой вершин) - void traversalCount(int** matrix, const int size)
В конце обхода вывести два получившихся списка всех узлов в порядке уменьшения количества ссылок на них. */



// Результатом работы должен стать один файл с кодом на языке С, содержащий функцию main и все необходимые функции.



int main(int argc, char const *argv[]){
    /* code */
    return 0;
}

